# Some Statistics with Baby Names

### Introduction:

We are going to use a subset of [US Baby Names](https://www.kaggle.com/kaggle/us-baby-names) from Kaggle.  
In the file it will be names from 2004 until 2014


### Step 1. Import the necessary libraries

In [1]:
#check if notebook runs in colab
import sys
IN_COLAB = 'google.colab' in sys.modules
print('running in Colab:',IN_COLAB)
path='..'
if IN_COLAB:
  #in colab, we need to clone the data from the repo
  !git clone https://github.com/keuperj/DataScienceSS20.git
  path='DataScienceSS20'

running in Colab: False

In [2]:
import pandas as pd

### Step 2. 
User ***Jupyter Lab*** to view ``path+"/DATA/US_Baby_Names_right.csv"``.

### Step 3. Assign it to a variable called baby_names.

In [3]:
baby_names = pd.read_csv(path+"/DATA/US_Baby_Names_right.csv")

### Step 4. See the first 10 entries

In [4]:
baby_names.head(10)

   Unnamed: 0     Id      Name  Year Gender State  Count
0       11349  11350      Emma  2004      F    AK     62
1       11350  11351   Madison  2004      F    AK     48
2       11351  11352    Hannah  2004      F    AK     46
3       11352  11353     Grace  2004      F    AK     44
4       11353  11354     Emily  2004      F    AK     41
5       11354  11355   Abigail  2004      F    AK     37
6       11355  11356    Olivia  2004      F    AK     33
7       11356  11357  Isabella  2004      F    AK     30
8       11357  11358    Alyssa  2004      F    AK     29
9       11358  11359    Sophia  2004      F    AK     28

### Step 5. Delete the column 'Unnamed: 0' and 'Id'

In [5]:
baby_names = baby_names.drop(['Unnamed: 0', 'Id'],1)
baby_names.head()

      Name  Year Gender State  Count
0     Emma  2004      F    AK     62
1  Madison  2004      F    AK     48
2   Hannah  2004      F    AK     46
3    Grace  2004      F    AK     44
4    Emily  2004      F    AK     41

### Step 6. Are there more male or female names in the dataset?

In [6]:
baby_names.Gender.value_counts()

F    558846
M    457549
Name: Gender, dtype: int64

### Step 7. Group the dataset by name and assign to names

In [7]:
names = baby_names.groupby('Name')

### Step 8. How many different names exist in the dataset?

In [39]:
names.size()

Name
Aaban        2
Aadan        4
Aadarsh      1
Aaden      196
Aadhav       1
          ...
Zyra         7
Zyrah        2
Zyren        1
Zyria       10
Zyriah       9
Length: 17632, dtype: int64

### Step 9. What is the name with most occurrences?

In [54]:
names.Name.count()

Name
Aaban        2
Aadan        4
Aadarsh      1
Aaden      196
Aadhav       1
          ...
Zyra         7
Zyrah        2
Zyren        1
Zyria       10
Zyriah       9
Name: Name, Length: 17632, dtype: int64

### Step 10. How many different names have the least occurrences?

### Step 11. What is the median name occurrence?

### Step 12. What is the standard deviation of names?

### Step 13. Get a summary with the mean, min, max, std and quartiles.

In [65]:
names.agg(["mean", "min", "max", "std", "quantile"])

                Year                                     Count           \
                mean   min   max       std quantile       mean min  max
Name
Aaban    2013.500000  2013  2014  0.707107   2013.5   6.000000   6    6
Aadan    2009.750000  2008  2014  2.872281   2008.5   5.750000   5    7
Aadarsh  2009.000000  2009  2009       NaN   2009.0   5.000000   5    5
Aaden    2010.015306  2005  2014  2.044322   2010.0  17.479592   5  158
Aadhav   2014.000000  2014  2014       NaN   2014.0   6.000000   6    6
...              ...   ...   ...       ...      ...        ...  ..  ...
Zyra     2012.142857  2008  2014  2.115701   2013.0   6.000000   5    8
Zyrah    2012.000000  2011  2013  1.414214   2012.0   5.500000   5    6
Zyren    2013.000000  2013  2013       NaN   2013.0   6.000000   6    6
Zyria    2008.900000  2005  2014  2.685351   2008.0   5.900000   5    7
Zyriah   2009.666667  2006  2014  2.915476   2009.0   6.444444   5   10


               std quantile
Name
Aaban     0.000000      6.0
Aadan     0.957427      5.5
Aadarsh        NaN      5.0
Aaden    21.154974     10.0
Aadhav         NaN      6.0
...            ...      ...
Zyra      1.154701      6.0
Zyrah     0.707107      5.5
Zyren          NaN      6.0
Zyria     0.737865      6.0
Zyriah    1.666667      6.0

[17632 rows x 10 columns]